package ensyu10;

/* 演習10-4
 * 日付クラス第4版を以下のように改良せよ
 * ・引数を受け取らないコンストラクタによるインスタンス生成時は、西暦1年1月1日で初期化するのではなくプログラム実行時の日付で初期化する
 * ・引数を受け取るコンストラクタには不正な値が指定された場合は、適当な値に調整する
 * さらに以下のメソッドを追加すること
 * 年内での経過日数を求めるメソッド
 * 年内の残り日数を求めるメソッド
 * 他の日付との前後関係を判定するメソッド
 * 日付をひとつ後ろに進めるメソッド
 * 次の日付を返却するメソッド
 * 日付をひとつ前に戻すメソッド
 * 前の日の日付を返却するメソッド
 * 日付をn日後ろに進めるメソッド
 * n日後の日付を返却するメソッド
 * 日付をn日前ろに進めるメソッド
 * n日前の日付を返却するメソッド
 */
public class Ensyu10_4 {

	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ
		// 315ページに現在時間の取得方法がある
	}

}
